artillery.yml
config:
  target: 'http://localhost:3003'
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 30
      name: "High traffic"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "browsing"
    flow:
    - get:
        url: "/{{ $randomNumber(1, 500) }}"
  - name: "levels query"
    flow:
    - get:
        url: "/levels/{{ $randomNumber(1, 500) }}"
  - name: "about query"
    flow:
    - get:
        url: "/about/{{ $randomNumber(1, 500) }}"