artillery.yml
config:
  target: 'http://localhost:3003'
  phases:
    - duration: 30
      arrivalRate: 10
      name: "High traffic"
    - duration: 10
      arrivalRate: 1
      name: "Slow down"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "browsing"
    flow:
      - loop:
        - get:
            url: "/{{ $randomNumber(1, 500) }}"
        count: 50
  - name: "levels query"
    flow:
      - loop:
        - get:
            url: "/levels/{{ $randomNumber(1, 500) }}"
        count: 50
  - name: "about query"
    flow:
      - loop:
        - get:
            url: "/about/{{ $randomNumber(1, 500) }}"
        count: 50